In [1]:
import pandas as pd

In [4]:
sr1=pd.Series([1,2,3,4,5])
sr1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
sr2=pd.Series([6,7,8,9,10])
sr2

0     6
1     7
2     8
3     9
4    10
dtype: int64

In [8]:
pd.concat([sr1,sr2],ignore_index=True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
df1=pd.DataFrame({'ID':[1,2,3,4],"Name":['A','B','C','D']})
df1

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [13]:
df2=pd.DataFrame({'ID':[5,6,7,8],"Name":['F','G','H','I']})
df2

   ID Name
0   5    F
1   6    G
2   7    H
3   8    I

In [16]:
pd.concat([df1,df2],axis=1,ignore_index=-True)

   0  1  2  3
0  5  F  5  F
1  6  G  6  G
2  7  H  7  H
3  8  I  8  I

In [17]:
df1=pd.DataFrame({'ID':[1,2,3,4],"Name":['A','B','C','D']})
df1

   ID Name
0   1    A
1   2    B
2   3    C
3   4    D

In [20]:
df2=pd.DataFrame({'ID':[5,6],"Name":['F','G']})
df2

   ID Name
0   5    F
1   6    G

In [23]:
pd.concat([df1,df2],axis=1,join='inner')

   ID Name  ID Name
0   1    A   5    F
1   2    B   6    G

In [24]:
pd.concat([df1,df2],axis=1,join='outer')

   ID Name   ID Name
0   1    A  5.0    F
1   2    B  6.0    G
2   3    C  NaN  NaN
3   4    D  NaN  NaN

In [27]:
pd.concat([df1,df2],axis=1,join='inner',keys=['first DF','second DF'])

  first DF      second DF
        ID Name        ID Name
0        1    A         5    F
1        2    B         6    G

In [28]:
pd.concat([df1,df2],axis=1,join='outer',keys=['first DF','second DF'])

  first DF      second DF
        ID Name        ID Name
0        1    A       5.0    F
1        2    B       6.0    G
2        3    C       NaN  NaN
3        4    D       NaN  NaN

In [30]:
df3=pd.DataFrame({'marks':[40,68,89,65]})
df3

   marks
0     40
1     68
2     89
3     65

In [33]:
pd.concat([df2,df3],sort=True)

    ID Name  marks
0  5.0    F    NaN
1  6.0    G    NaN
0  NaN  NaN   40.0
1  NaN  NaN   68.0
2  NaN  NaN   89.0
3  NaN  NaN   65.0

In [37]:
pd.concat([df1,df2],axis=1)

   ID Name   ID Name
0   1    A  5.0    F
1   2    B  6.0    G
2   3    C  NaN  NaN
3   4    D  NaN  NaN